src/main/resources/request5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://generated.soapexample.com">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getFileRequest>
            <gs:fileName>file1.txt</gs:fileName>
        </gs:getFileRequest>
    </soapenv:Body>
</soapenv:Envelope>